#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_service_account.org_policy_compare_sa: Refreshing state... [id=projects/orgpolicy-notifier/serviceAccounts/org-policy-compare-dev@orgpolicy-notifier.iam.gserviceaccount.com]
random_id.random: Refreshing state... [id=_m0SSQ]
module.pubsub_scheduled_example.module.main.null_resource.dependent_files: Refreshing state... [id=2431744087259537940]
google_storage_bucket.policy_bucket: Refreshing state... [id=orgpolicy-notifier-policy-bucket-fe6d1249-dev]
module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files: Refreshing state...
module.pubsub_scheduled_example.module.main.data.archive_file.main: Refreshing state...
module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic-dev]
module.pubsub_scheduled_example.module.main.google_storage_bucket.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-fe6d1249-dev]
module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-fe6d1249-dev-18a3c753c7841dd7d326bf2c0200bda8-src.zip]
module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0]: Refreshing state... [id=projects/orgpolicy-notifier/locations/us-central1/jobs/orgpolicy-notifier-job-fe6d1249-dev]
module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main: Refreshing state... [id=projects/orgpolicy-notifier/locations/us-central1/functions/orgpolicy-notifier-fe6d1249-dev]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_organization_iam_custom_role.org_policy_compare_custom_role will be created
  + resource "google_organization_iam_custom_role" "org_policy_compare_custom_role" {
      + deleted     = (known after apply)
      + description = "IAM role for Cloud Function to Compare Org Policies"
      + id          = (known after apply)
      + name        = (known after apply)
      + org_id      = "948721840059"
      + permissions = [
          + "orgpolicy.policy.get",
          + "resourcemanager.projects.get",
          + "resourcemanager.projects.list",
          + "secretmanager.secrets.get",
          + "secretmanager.versions.access",
          + "secretmanager.versions.get",
          + "storage.objects.create",
          + "storage.objects.delete",
          + "storage.objects.get",
          + "storage.objects.list",
          + "storage.objects.update",
        ]
      + role_id     = "org_policy_compare_cfn_dev"
      + stage       = "GA"
      + title       = "Organization Policy Function Role"
    }

  # google_organization_iam_member.org_policy_compare_member will be created
  + resource "google_organization_iam_member" "org_policy_compare_member" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:org-policy-compare-dev@orgpolicy-notifier.iam.gserviceaccount.com"
      + org_id = "948721840059"
      + role   = "organizations/948721840059/roles/org_policy_compare_cfn_dev"
    }

  # module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "main" {
        available_memory_mb           = 2048
        description                   = "Compares Org Policies and alerts users."
        entry_point                   = "announce_kickoff"
        environment_variables         = {
            "ACCESS_TOKEN_NAME"        = "dev_twitter_access_token"
            "ACCESS_TOKEN_SECRET_NAME" = "dev_twitter_access_secret"
            "CONSUMER_KEY_NAME"        = "dev_twitter_api_key"
            "CONSUMER_KEY_SECRET_NAME" = "dev_twitter_api_secret"
            "ENVIRONMENT"              = "dev"
            "FILE_LOCATION"            = "/tmp/policies.txt"
            "ORG_ID"                   = "948721840059"
            "POLICY_BUCKET"            = "orgpolicy-notifier-policy-bucket-fe6d1249-dev"
            "POLICY_FILE"              = "policies.txt"
            "S_PROJECT"                = "orgpolicy-notifier"
            "S_SLACK_NAME"             = "dev_slack_webhook"
            "S_TOKEN_NAME"             = "dev_github_token"
            "S_VERSION"                = "latest"
        }
      + https_trigger_url             = (known after apply)
      ~ id                            = "projects/orgpolicy-notifier/locations/us-central1/functions/orgpolicy-notifier-fe6d1249-dev" -> (known after apply)
        ingress_settings              = "ALLOW_ALL"
      - labels                        = {} -> null
        max_instances                 = 0
        name                          = "orgpolicy-notifier-fe6d1249-dev"
        project                       = "orgpolicy-notifier"
        region                        = "us-central1"
        runtime                       = "python37"
        service_account_email         = "org-policy-compare-dev@orgpolicy-notifier.iam.gserviceaccount.com"
        source_archive_bucket         = "orgpolicy-notifier-cfn-bucket-fe6d1249-dev"
        source_archive_object         = "18a3c753c7841dd7d326bf2c0200bda8-src.zip"
        timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      ~ event_trigger {
            event_type = "google.pubsub.topic.publish"
          ~ resource   = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic-dev" -> "orgpolicy-notifier-topic-dev"

            failure_policy {
                retry = false
            }
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @iloveicedgreentea, Action: `pull_request`, Working Directory: ``, Workflow: `Development environment checks and Terraform`*